In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.2'

In [9]:
products = pd.read_csv('/workspaces/fc_engineer-codetest/data_sources/pricing-1.csv', delimiter=',', encoding='utf-8')

In [10]:
products

           puk     product  price
0  72527273070  Samsung TV    599
1  72527273071        iPad    499
2  72527273072     Macbook   1299
3  72527273073      iPhone    999
4  72527273074  Samsung TV    599
5  72527273075      Kindle     89

In [19]:
users = pd.read_csv('/workspaces/fc_engineer-codetest/data_sources/users-1.csv', delimiter=',', encoding='utf-8')

In [20]:
users

   user_id           name                  email date_joined
0        1       John Doe      johndoe@email.com  2022-01-01
1        2     Jane Smith    JaneSmith@email.com  2022-01-05
2        3   Robert Brown  robertBROWN@email.net  2022-01-10
3        4      Lucy Gray    lucy.gray@email.com  2022-02-01
4        5  Michael Green       MGreen@email.org  2022-02-15

In [13]:
transactions = pd.read_csv('/workspaces/fc_engineer-codetest/data_sources/transactions-1.csv', delimiter=',', encoding='utf-8')

In [16]:
transactions['product'].unique()

array(['Samsung TV', 'iPad', 'Macbook', 'iPhone', 'Kindle'], dtype=object)

In [21]:
transactions['user_id'].unique()

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [23]:
transactions[transactions['user_id']>5]

    trans_id  user_id     product amount  trans_date
12      1026        6  Samsung TV    599  2022-07-16
18      1032        7      iPhone    999  2022-09-16
26      1040        8     Macbook   1299  2022-12-02
28      1042        9      iPhone    999  2022-12-17
34      1048        6      Kindle     89  2023-02-17
37      1051        9     Macbook   1299  2023-03-17
44      1058        7      Kindle     89  2023-06-02
54      1068        8      Kindle     89  2023-09-16
60      1074        9        iPad    499  2023-11-16
75      1089        6  Samsung TV    599  2024-04-05
76      1090        7        iPad    499  2024-04-10
77      1091        8     Macbook   1299  2024-04-15
78      1092        9      iPhone    999  2024-04-20

In [25]:
transactions['product'].unique()

array(['Samsung TV', 'iPad', 'Macbook', 'iPhone', 'Kindle'], dtype=object)

In [27]:
transactions.dtypes

trans_id       int64
user_id        int64
product       object
amount        object
trans_date    object
dtype: object

In [30]:
users.dtypes

user_id         int64
name           object
email          object
date_joined    object
dtype: object

In [32]:
products.dtypes

puk         int64
product    object
price       int64
dtype: object

In [34]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   trans_id    84 non-null     int64
 1   user_id     84 non-null     int64
 2   product     84 non-null     object
 3   amount      84 non-null     object
 4   trans_date  83 non-null     object
dtypes: int64(2), object(3)
memory usage: 3.4+ KB

In [43]:
transactions['amount'].unique()

array(['599', '499', '1299', '999', '89', '2022-10-17', '49..9'],
      dtype=object)

In [44]:
transactions[transactions['amount']=='49..9']

    trans_id  user_id product amount  trans_date
30      1044        1    iPad  49..9  2023-01-16

In [48]:
transactions[transactions['trans_date'].isna()]

    trans_id  user_id  product      amount trans_date
22      1036        3  Macbook  2022-10-17        NaN

In [37]:
transactions.head()

   trans_id  user_id     product amount  trans_date
0      1014        1  Samsung TV    599  2022-04-01
1      1015        2        iPad    499  2022-04-05
2      1016        3     Macbook   1299  2022-04-10
3      1017        4      iPhone    999  2022-04-15
4      1018        5  Samsung TV    599  2022-04-20

In [52]:
transactions.shape[0]

84

In [55]:
transactions['trans_id'].nunique()

84